public/xmlService/mpaRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Execute>
         <tem:message><![CDATA[<Request xmlns:mpa="http://amadeus.com/latam/mpa/2010/1">
    <mpa:Command>{method}</mpa:Command>
    <mpa:Version>1.0</mpa:Version>
    <mpa:Language>es</mpa:Language>
    <mpa:ResponseType>XML</mpa:ResponseType>
    <mpa:Target>Test</mpa:Target>
    <mpa:MaxExecutionTime>200</mpa:MaxExecutionTime>
    <mpa:PageSize>0</mpa:PageSize>
    <mpa:PageNumber>1</mpa:PageNumber>
    <mpa:CacheRefresh>true</mpa:CacheRefresh>
    <mpa:Message>{body}</mpa:Message>
    <mpa:ProviderSettings>    
        <mpa:ProviderSetting>        
            <mpa:Setting Key="ProviderId" Value="{ProviderId}"/>      
            <mpa:Setting Key="Language" Value="ES"/>    
        </mpa:ProviderSetting>
    </mpa:ProviderSettings>
</Request>
        ]]></tem:message>
        </tem:Execute>
    </soapenv:Body>
</soapenv:Envelope>